# IsInUse Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireMaterialType..::..IsInUse Property
WireMaterialType Class See Also
---
Indicate whether the wire material type is in use.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInUse { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsInUse As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsInUse {
	bool get ();
}
```

# See Also
WireMaterialType Class
Autodesk.Revit.DB.Electrical Namespace